In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("eda_hypothetical_dataset.csv")

In [3]:
df=df.dropna(subset=["Customer_ID","Signup_Date"])

In [7]:
df.head()

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800,800,33119.0,2.0,Desktop,LOYAL,0,1
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800,2400,47764.0,2.0,Desktop,SUMMER,0,1
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800,1600,30213.0,4.0,Desktop,NEWUSER,0,1
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800,1600,62067.0,4.0,Desktop,NONE,0,0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 195 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [9]:
median_age=df['Age'].median()

In [10]:
print(median_age)

44.0

In [11]:
df["Age"]=df["Age"].fillna(median_age)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 200 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              195 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [13]:
df["Income"]=df["Income"].fillna(df['Income'].median())

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 200 non-null    float64
 2   Gender              195 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              200 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [15]:
df['Gender']=df['Gender'].fillna('Unkown')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         200 non-null    object
 1   Age                 200 non-null    float64
 2   Gender              200 non-null    object
 3   City                200 non-null    object
 4   Signup_Date         200 non-null    object
 5   Last_Purchase_Date  195 non-null    object
 6   Product             200 non-null    object
 7   Units_Sold          200 non-null    int64
 8   Price               200 non-null    object
 9   Total_Amount        200 non-null    int64
 10  Income              200 non-null    float64
 11  Feedback_Score      186 non-null    float64
 12  Device              200 non-null    object
 13  Promo_Code          197 non-null    object
 14  Fraud_Flag          200 non-null    int64
 15  Churned             200 non-null    int64
dtypes: float64(3), int64(4), object(9)
memory usage: 25.1+ KB

In [17]:
threshold=0.4
df=df.loc[:,df.isnull().mean() < threshold]

In [18]:
## identify missing value
df[df['Age']>100]

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
77,C1077,150.0,Female,Bangalore,2022-08-18,2023-03-13,B,1,1200,1200,51512.0,3.0,Desktop,WINTER,0,0

In [21]:
df.loc[df['Age'] > 100, 'Age']=df['Age'].median()

In [22]:
df.duplicated().sum()

np.int64(0)

In [24]:
df.drop_duplicates(subset=['Customer_ID'],keep="first")

,Customer_ID,Age,Gender,City,Signup_Date,Last_Purchase_Date,Product,Units_Sold,Price,Total_Amount,Income,Feedback_Score,Device,Promo_Code,Fraud_Flag,Churned
0,C1000,56.0,Female,Bangalore,2022-10-04,2023-10-10,C,1,800,800,33119.0,2.0,Desktop,LOYAL,0,1
1,C1001,69.0,Female,Kolkata,2024-01-31,2024-10-13,C,3,800,2400,47764.0,2.0,Desktop,SUMMER,0,1
2,C1002,46.0,Male,Delhi,2023-11-07,2024-05-22,B,30,1200,3600,49900.0,3.0,Desktop,NEWUSER,0,0
3,C1003,32.0,Male,Kolkata,2023-01-29,2023-11-28,C,2,800,1600,30213.0,4.0,Desktop,NEWUSER,0,1
4,C1004,60.0,Female,Mumbai,2023-04-02,2023-04-12,C,2,800,1600,62067.0,4.0,Desktop,NONE,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,C1195,69.0,Female,Kolkata,2023-07-12,2024-01-15,D,3,1500,4500,32396.0,4.0,Mobile,NEWUSER,0,0
196,C1196,30.0,Female,Bangalore,01-Jul-2023,2024-05-08,B,1,1200,1200,61939.0,5.0,Mobile,WINTER,0,0
197,C1197,58.0,Male,Kolkata,2022-09-10,2023-09-16,C,4,800,3200,65728.0,3.0,Desktop,SUMMER,0,0
198,C1198,20.0,Male,Chennai,2023-01-25,2023-02-01,A,3,500,1500,55154.0,5.0,Desktop,SUMMER,0,0
199,C1199,56.0,Female,Mumbai,2023-08-17,NaN,A,3,500,1500,44352.0,1.0,Mobile,NEWUSER,0,0

In [25]:
df['City'].head()

0    Bangalore
1      Kolkata
2        Delhi
3      Kolkata
4       Mumbai
Name: City, dtype: object

In [26]:
df.describe()

,Age,Units_Sold,Total_Amount,Income,Feedback_Score,Fraud_Flag,Churned
count,200.000000,200.000000,200.00000,2.000000e+02,186.000000,200.000000,200.000000
mean,43.290000,2.580000,2461.16500,9.766873e+04,3.096774,0.015000,0.415000
std,14.990647,2.246963,1448.39236,7.038897e+05,1.356183,0.121857,0.493958
min,3.000000,-1.000000,500.00000,-1.000000e+03,1.000000,0.000000,0.000000
25%,31.000000,1.000000,1478.25000,3.772025e+04,2.000000,0.000000,0.000000
50%,44.000000,2.500000,2400.00000,4.827700e+04,3.000000,0.000000,0.000000
75%,56.000000,3.000000,3299.00000,5.873200e+04,4.000000,0.000000,1.000000
max,69.000000,30.000000,6000.00000,9.999999e+06,5.000000,1.000000,1.000000

In [28]:
df['City']=df['City'].astype(str).str.strip().str.title()

In [29]:
df['City'].value_counts()

City
Delhi        47
Kolkata      45
Chennai      41
Mumbai       37
Bangalore    30
Name: count, dtype: int64